package com.djhb.petopia.presentation.admin.post

data class AdminPostModel(
    val page: String,
    val title: String,
    val subTitle: String,
    val post: String
)

fun getAdminPostLeftItems(): List<AdminPostModel> = listOf(
    AdminPostModel(
        "1/5",
        "무지개다리를 건너기 전 증상",
        "어딘가 달라진 행동을 보고\n조금 더 후회없는 인사를 할 수 있도록\n임종 직전에 많이 나타나는\n신체적 증상을 알려드릴게요.",
        "어딘가 달라진 행동을 보고\n조금 더 후회없는 인사를 할 수 있도록\n임종 직전에 많이 나타나는\n신체적 증상을 알려드릴게요."
    ),
    AdminPostModel(
        "2/5", "마지막 인사",
        "어딘가 달라진 행동을 보고\n조금 더 후회없는 인사를 할 수 있도록\n임종 직전에 많이 나타나는\n신체적 증상을 알려드릴게요.",
        "어딘가 달라진 행동을 보고\n조금 더 후회없는 인사를 할 수 있도록\n임종 직전에 많이 나타나는\n신체적 증상을 알려드릴게요."
    ),
    AdminPostModel(
        "3/5", "먼 여행을 떠난 직후",
        "어딘가 달라진 행동을 보고\n조금 더 후회없는 인사를 할 수 있도록\n임종 직전에 많이 나타나는\n신체적 증상을 알려드릴게요.",
        "어딘가 달라진 행동을 보고\n조금 더 후회없는 인사를 할 수 있도록\n임종 직전에 많이 나타나는\n신체적 증상을 알려드릴게요."
    ),
    AdminPostModel(
        "4/5", "먼 여행을 떠난 직후",
        "어딘가 달라진 행동을 보고\n조금 더 후회없는 인사를 할 수 있도록\n임종 직전에 많이 나타나는\n신체적 증상을 알려드릴게요.",
        "어딘가 달라진 행동을 보고\n조금 더 후회없는 인사를 할 수 있도록\n임종 직전에 많이 나타나는\n신체적 증상을 알려드릴게요."
    ),
    AdminPostModel(
        "5/5", "먼 여행을 떠난 직후",
        "어딘가 달라진 행동을 보고\n조금 더 후회없는 인사를 할 수 있도록\n임종 직전에 많이 나타나는\n신체적 증상을 알려드릴게요.",
        "어딘가 달라진 행동을 보고\n조금 더 후회없는 인사를 할 수 있도록\n임종 직전에 많이 나타나는\n신체적 증상을 알려드릴게요."
    )
)

fun getAdminPostRightItems(): List<AdminPostModel> = listOf(
    AdminPostModel(
        "1/5",
        "펫로스 증후군이란",
        "어딘가 달라진 행동을 보고\n조금 더 후회없는 인사를 할 수 있도록\n임종 직전에 많이 나타나는\n신체적 증상을 알려드릴게요.",
        "어딘가 달라진 행동을 보고\n조금 더 후회없는 인사를 할 수 있도록\n임종 직전에 많이 나타나는\n신체적 증상을 알려드릴게요."
    ),
    AdminPostModel(
        "2/5", "보고싶을 때 들으면 위로되는 노래",
        "어딘가 달라진 행동을 보고\n조금 더 후회없는 인사를 할 수 있도록\n임종 직전에 많이 나타나는\n신체적 증상을 알려드릴게요.",
        "어딘가 달라진 행동을 보고\n조금 더 후회없는 인사를 할 수 있도록\n임종 직전에 많이 나타나는\n신체적 증상을 알려드릴게요."
    ),
    AdminPostModel(
        "3/5", "상실감, 어떻게 돌봐야 할까",
        "어딘가 달라진 행동을 보고\n조금 더 후회없는 인사를 할 수 있도록\n임종 직전에 많이 나타나는\n신체적 증상을 알려드릴게요.",
        "어딘가 달라진 행동을 보고\n조금 더 후회없는 인사를 할 수 있도록\n임종 직전에 많이 나타나는\n신체적 증상을 알려드릴게요."
    ),
    AdminPostModel(
        "4/5", "상실감, 어떻게 돌봐야 할까",
        "어딘가 달라진 행동을 보고\n조금 더 후회없는 인사를 할 수 있도록\n임종 직전에 많이 나타나는\n신체적 증상을 알려드릴게요.",
        "어딘가 달라진 행동을 보고\n조금 더 후회없는 인사를 할 수 있도록\n임종 직전에 많이 나타나는\n신체적 증상을 알려드릴게요."
    ),
    AdminPostModel(
        "5/5", "상실감, 어떻게 돌봐야 할까",
        "어딘가 달라진 행동을 보고\n조금 더 후회없는 인사를 할 수 있도록\n임종 직전에 많이 나타나는\n신체적 증상을 알려드릴게요.",
        "어딘가 달라진 행동을 보고\n조금 더 후회없는 인사를 할 수 있도록\n임종 직전에 많이 나타나는\n신체적 증상을 알려드릴게요."
    )
)